In [1]:
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

In [2]:
df = pd.read_csv('Ask A Manager Salary Survey 2021 (Responses) - Form Responses 1.csv')
df

,Timestamp,How old are you?,What industry do you work in?,Job title,"If your job title needs additional context, please clarify here:","What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)","How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.",Please indicate the currency,"If ""Other,"" please indicate the currency here:","If your income needs additional context, please provide it here:",What country do you work in?,"If you're in the U.S., what state do you work in?",What city do you work in?,How many years of professional work experience do you have overall?,How many years of professional work experience do you have in your field?,What is your highest level of education completed?,What is your gender?,What is your race? (Choose all that apply.)
0,4/27/2021 11:02,25-34,Education (Higher Education),Research and Instruction Librarian,NaN,"55,000",0.0,USD,NaN,NaN,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White
1,4/27/2021 11:02,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White
2,4/27/2021 11:02,25-34,"Accounting, Banking & Finance",Marketing Specialist,NaN,"34,000",NaN,USD,NaN,NaN,US,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,White
3,4/27/2021 11:02,25-34,Nonprofits,Program Manager,NaN,"62,000",3000.0,USD,NaN,NaN,USA,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,White
4,4/27/2021 11:02,25-34,"Accounting, Banking & Finance",Accounting Manager,NaN,"60,000",7000.0,USD,NaN,NaN,US,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,White
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
27956,4/18/2023 9:26,35-44,Computing or Tech,Porting Agent,Port phone numbers from one carrier to another,60000,5000.0,USD,NaN,NaN,United States,Georgia,Atlanta,21 - 30 years,2 - 4 years,Some college,Man,"Hispanic, Latino, or Spanish origin"
27957,4/21/2023 10:22,25-34,Research / Gov,Post-doctoral Associate,Research Scientist at NASA,83000,NaN,USD,NaN,NaN,United States,District of Columbia,Dc,2 - 4 years,2 - 4 years,PhD,Man,White
27958,4/24/2023 19:45,25-34,"Accounting, Banking & Finance",CRM Manager,NaN,57000,NaN,GBP,NaN,NaN,UK,NaN,London,5-7 years,2 - 4 years,Some college,Woman,White
27959,4/29/2023 15:24,18-24,Engineering or Manufacturing,Data Engineer,NaN,10000,NaN,Other,NaN,NaN,India,NaN,Banglore,1 year or less,1 year or less,NaN,Man,Asian or Asian American
27960,5/9/2023 17:57,45-54,Computing or Tech,Junior Data Analyst,NaN,65000,0.0,USD,NaN,NaN,USA,Virginia,Richmond,21 - 30 years,1 year or less,College degree,Man,White

# Data Cleaning
### we will go through each column and clean it

## Age column

In [3]:
#Age column doesn't need to be cleaned, but we will rename it to Age to make it easier to work with
df['Age'] = df['How old are you?']
df.drop('How old are you?', axis = 1, inplace = True)

In [4]:
df['Age']

0        25-34
1        25-34
2        25-34
3        25-34
4        25-34
         ...
27956    35-44
27957    25-34
27958    25-34
27959    18-24
27960    45-54
Name: Age, Length: 27961, dtype: object

In [5]:
df.columns

Index(['Timestamp', 'What industry do you work in?', 'Job title',
       'If your job title needs additional context, please clarify here:',
       'What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)',
       'How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.',
       'Please indicate the currency',
       'If "Other," please indicate the currency here: ',
       'If your income needs additional context, please provide it here:',
       'What country do you work in?',
       'If you're in the U.S., what state do you work in?',
       'What city do you work in?',
       'How many years of professional work experience do you have overall?',
       'How many years of professional work experience do you have in your field?',
       'What is your highest level of education completed?',
       'What is your gender?', 'What is your race? (Choose all that apply.)',
       'Age'],
      dtype='object')

## Industry column

In [6]:
df['What industry do you work in?'].value_counts()

Computing or Tech                                4678
Education (Higher Education)                     2458
Nonprofits                                       2417
Health care                                      1888
Government and Public Administration             1882
                                                 ...
Food processing                                     1
Architectural/Land Planning/Civil Engineering       1
Gaming (Gambling)                                   1
Regulatory Affairs- nutraceuticals                  1
Research / Gov                                      1
Name: What industry do you work in?, Length: 1212, dtype: int64

In [7]:
# replace float values with Other and make all the values lowercase because there are some upper case and some lower case for the same industry
df['What industry do you work in?'] = df['What industry do you work in?'].apply(lambda x: x.lower() if type(x) == str else 'Other')

In [8]:
# we will see here that number of rows have been decreased from 1,212(before lower casing) to 1,096(after lower casing)
df['What industry do you work in?'].value_counts()

computing or tech                       4678
education (higher education)            2458
nonprofits                              2417
health care                             1888
government and public administration    1882
                                        ...
data analytics                             1
luxury fashion                             1
data entry                                 1
wholesale and retail trade                 1
research / gov                             1
Name: What industry do you work in?, Length: 1096, dtype: int64

In [9]:
# finally lets rename the column to Industry to make it easier to work with
df['Industry'] = df['What industry do you work in?']
df.drop('What industry do you work in?', axis = 1, inplace = True)

## Job title column

In [10]:
df['Job title'].value_counts()

Software Engineer                               286
Project Manager                                 230
Director                                        198
Senior Software Engineer                        196
Program Manager                                 152
                                               ...
Senior Manager, Organizational Effectiveness      1
Sr Director Engineering                           1
Engineering Manager II                            1
Corporate communications manager                  1
Junior Data Analyst                               1
Name: Job title, Length: 14297, dtype: int64

In [11]:
# making all the job titles lowercase for the same reason we did with Industry column
df['Job title'] = df['Job title'].apply(lambda x: x.lower())
# again number of rows have been decreased which means some of the job titles were upper case and some were lower case
df['Job title'].value_counts()

software engineer                              356
project manager                                262
senior software engineer                       231
director                                       202
program manager                                183
                                              ...
manager, programming & community engagement      1
executive producer - events and content          1
youth specialist                                 1
fellow physician                                 1
junior data analyst                              1
Name: Job title, Length: 13045, dtype: int64

## Additional context column

In [12]:
df['If your job title needs additional context, please clarify here:'].isna().sum()

20725

In [13]:
#drop the if your job columns since over 75% of the rows are null
df.drop('If your job title needs additional context, please clarify here:', axis=1, inplace=True)

In [14]:
df.columns

Index(['Timestamp', 'Job title',
       'What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)',
       'How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.',
       'Please indicate the currency',
       'If "Other," please indicate the currency here: ',
       'If your income needs additional context, please provide it here:',
       'What country do you work in?',
       'If you're in the U.S., what state do you work in?',
       'What city do you work in?',
       'How many years of professional work experience do you have overall?',
       'How many years of professional work experience do you have in your field?',
       'What is your highest level of education completed?',
       'What is your gender?', 'What is your race? (Choose all that apply.)',
       'Age', 'Industry'],
      dtype='object')

## Annual salary column

In [15]:
# rename the column to Salary
df['Salary'] = df.iloc[:,2]
df.drop(df.columns[2], axis=1, inplace=True)

In [16]:
df['Salary'].value_counts()

60,000     430
80,000     406
70,000     402
65,000     400
75,000     383
          ...
86,520       1
155,375      1
27,070       1
73,320       1
116421       1
Name: Salary, Length: 4287, dtype: int64

In [17]:
#drop the comma from the salary column so we can convert it to float
df['Salary'] = df['Salary'].apply(lambda x: x.replace(',', ''))
#convert the salary column to a float, so we can add it to the bonus column
df['Salary'] = df['Salary'].astype(float)

## Additional monetary compensation column

In [18]:
# rename the column to Bonus
df['Bonus'] = df.iloc[:,2]
df.drop(df.columns[2], axis=1, inplace=True)

In [19]:
df['Bonus'].isna().sum()

7262

In [20]:
df['Bonus'].value_counts()

0.0        7921
5000.0     1108
10000.0     958
2000.0      773
1000.0      676
           ...
12400.0       1
5275.0        1
3009.0        1
36500.0       1
9075.0        1
Name: Bonus, Length: 843, dtype: int64

In [21]:
#fill the null values with 0 so we can add it to the salary column later
df['Bonus'].fillna(0, inplace=True)

In [22]:
df['Bonus'].value_counts()

0.0        15183
5000.0      1108
10000.0      958
2000.0       773
1000.0       676
           ...
12400.0        1
5275.0         1
3009.0         1
36500.0        1
9075.0         1
Name: Bonus, Length: 843, dtype: int64

## create a new column called total_salary which is the sum of salary and bonus columns

## before that lets fix the currency column by converting all the currencies to USD
### for this problem and to be dynamic, we will use the currency converter pacakge
#### for more information visit https://pypi.org/project/CurrencyConverter/

In [23]:
# create a new column called total_salary which is the sum of salary and bonus columns
df['total_salary'] = df['Salary'] + df['Bonus']

In [24]:
pip install CurrencyConverter

Requirement already satisfied: CurrencyConverter in c:\users\medo2\anaconda3\lib\site-packages (0.17.7)
Note: you may need to restart the kernel to use updated packages.

In [25]:
from currency_converter import CurrencyConverter
c = CurrencyConverter()

In [26]:
#change the total_salary of every non USD currency to USD
df['total_salary'] = df.apply(lambda x: x['total_salary'] * c.convert(1, 'CAD', 'USD') if x['Please indicate the currency'] == 'CAD' else x['total_salary'], axis=1)
df['total_salary'] = df.apply(lambda x: x['total_salary'] * c.convert(1, 'GBP', 'USD') if x['Please indicate the currency'] == 'GBP' else x['total_salary'], axis=1)
df['total_salary'] = df.apply(lambda x: x['total_salary'] * c.convert(1, 'EUR', 'USD') if x['Please indicate the currency'] == 'EUR' else x['total_salary'], axis=1)
df['total_salary'] = df.apply(lambda x: x['total_salary'] * c.convert(1, 'AUD', 'USD') if x['Please indicate the currency'] == 'AUD/NZD' else x['total_salary'], axis=1)
df.total_salary

0        55000.000000
1        72814.841637
2        34000.000000
3        65000.000000
4        67000.000000
             ...
27956    65000.000000
27957    83000.000000
27958    70826.723094
27959    10000.000000
27960    65000.000000
Name: total_salary, Length: 27961, dtype: float64

In [27]:
#convert every currency to USD after converting the salary
df['Please indicate the currency'] = df['Please indicate the currency'].apply(lambda x: x.replace('CAD', 'USD').replace('GBP', 'USD').replace('EUR', 'USD').replace('AUD/NZD', 'USD'))
df['Please indicate the currency'].value_counts()

USD      27689
Other      157
CHF         37
SEK         37
JPY         23
ZAR         14
HKD          4
Name: Please indicate the currency, dtype: int64

In [28]:
# drop any non USD currency
df = df[df['Please indicate the currency'] == 'USD']
# drop the currency column since it is all USD now
df.drop('Please indicate the currency', axis=1, inplace=True)

In [29]:
#drop the if other currency column since we will use only USD
df.drop('If "Other," please indicate the currency here: ', axis=1, inplace=True)

In [30]:
#drop the if your work needs additional context column since most of the rows are null and it doesn't add any value
df.drop('If your income needs additional context, please provide it here:', axis=1, inplace=True)

## Country column
### # it looks like the column has many problems like the lower and upper case, some countries have spaces before and after the name, and some countries have different names for the same country

In [31]:
# first lets rename the column to Country
df['Country'] = df['What country do you work in?']
df.drop('What country do you work in?', axis=1, inplace=True)

In [32]:
df['Country'].value_counts()

United States             8963
USA                       7912
US                        2604
Canada                    1561
United States              665
                          ...
United Kingdomk              1
 New Zealand                 1
Cuba                         1
Australi                     1
Bosnia and Herzegovina       1
Name: Country, Length: 336, dtype: int64

In [33]:
# first lets strip the column to remove any spaces before and after the country name
df['Country'] = df['Country'].apply(lambda x: x.strip())

### now for the different names for the same country, we will use the following functions to fix the problem

In [34]:
# a function that convert all the rows that start with letters US, Us, uS, us, USA, usa to United States
def united_states_fixer(x):
    if x.lower() in ['usa', 'us', 'united states', 'united states of america', 'u.s.', 'u.s.a', 'u.s.a.', 'u.s', 'u. s.', 'unites states', 'the united states', 'united state']:
        return 'United States'
    else:
        return x

In [35]:
def united_kingdom_fixer(x):
    if x.lower() in ['uk', 'united kingdom', 'u.k.', 'u.k', 'u. k.' , 'england', 'great britain', 'england, uk']:
        return 'United Kingdom'
    else:
        return x

In [36]:
def canada_fixer(x):
    if x.lower() in ['canada', 'ca']:
        return 'Canada'
    else:
        return x

In [37]:
df['Country'] = df['Country'].apply(united_states_fixer)
df['Country'] = df['Country'].apply(united_kingdom_fixer)
df['Country'] = df['Country'].apply(canada_fixer)

In [38]:
df['Country'].value_counts()

United States                                            22994
Canada                                                    1669
United Kingdom                                            1511
Australia                                                  379
Germany                                                    191
                                                         ...
Eritrea                                                      1
For the United States government, but posted overseas        1
IS                                                           1
United Kingdomk                                              1
Bosnia and Herzegovina                                       1
Name: Country, Length: 239, dtype: int64

In [39]:
# now after solving the problem lets drop any rows that outside the top 7 countries
countries = ['United States', 'United Kingdom', 'Canada', 'Australia', 'Germany', 'Ireland', 'New Zealand']

In [40]:
df = df[df['Country'].isin(countries)]

In [41]:
df['Country'].value_counts()

United States     22994
Canada             1669
United Kingdom     1511
Australia           379
Germany             191
Ireland             120
New Zealand         114
Name: Country, dtype: int64

In [42]:
df

,Timestamp,Job title,"If you're in the U.S., what state do you work in?",What city do you work in?,How many years of professional work experience do you have overall?,How many years of professional work experience do you have in your field?,What is your highest level of education completed?,What is your gender?,What is your race? (Choose all that apply.),Age,Industry,Salary,Bonus,total_salary,Country
0,4/27/2021 11:02,research and instruction librarian,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White,25-34,education (higher education),55000.0,0.0,55000.000000,United States
1,4/27/2021 11:02,change & internal communications manager,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White,25-34,computing or tech,54600.0,4000.0,72814.841637,United Kingdom
2,4/27/2021 11:02,marketing specialist,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,White,25-34,"accounting, banking & finance",34000.0,0.0,34000.000000,United States
3,4/27/2021 11:02,program manager,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,White,25-34,nonprofits,62000.0,3000.0,65000.000000,United States
4,4/27/2021 11:02,accounting manager,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,White,25-34,"accounting, banking & finance",60000.0,7000.0,67000.000000,United States
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
27955,4/17/2023 9:40,waitress,New York,Rochester,5-7 years,2 - 4 years,Some college,Woman,White,18-24,hospitality & events,35000.0,10000.0,45000.000000,United States
27956,4/18/2023 9:26,porting agent,Georgia,Atlanta,21 - 30 years,2 - 4 years,Some college,Man,"Hispanic, Latino, or Spanish origin",35-44,computing or tech,60000.0,5000.0,65000.000000,United States
27957,4/21/2023 10:22,post-doctoral associate,District of Columbia,Dc,2 - 4 years,2 - 4 years,PhD,Man,White,25-34,research / gov,83000.0,0.0,83000.000000,United States
27958,4/24/2023 19:45,crm manager,NaN,London,5-7 years,2 - 4 years,Some college,Woman,White,25-34,"accounting, banking & finance",57000.0,0.0,70826.723094,United Kingdom
27960,5/9/2023 17:57,junior data analyst,Virginia,Richmond,21 - 30 years,1 year or less,College degree,Man,White,45-54,computing or tech,65000.0,0.0,65000.000000,United States

In [43]:
# drop Timestamp column
df.drop('Timestamp', axis=1, inplace=True)

In [44]:
df.columns

Index(['Job title', 'If you're in the U.S., what state do you work in?',
       'What city do you work in?',
       'How many years of professional work experience do you have overall?',
       'How many years of professional work experience do you have in your field?',
       'What is your highest level of education completed?',
       'What is your gender?', 'What is your race? (Choose all that apply.)',
       'Age', 'Industry', 'Salary', 'Bonus', 'total_salary', 'Country'],
      dtype='object')

## State column

In [45]:
# rename the column to State
df['State'] = df[df.columns[1]]
df.drop(df.columns[1], axis=1, inplace=True)

In [46]:
df['State'].value_counts()

California                                                2583
New York                                                  2159
Massachusetts                                             1513
Texas                                                     1249
Illinois                                                  1200
                                                          ...
District of Columbia, Maryland, Pennsylvania, Virginia       1
Arkansas, Iowa, Massachusetts, Ohio, Wyoming                 1
New York, Texas                                              1
California, Montana                                          1
Alabama, Oregon                                              1
Name: State, Length: 131, dtype: int64

In [47]:
df['State'].isna().sum()

4152

In [48]:
# first we will fill the null values for the people who work outside the US with Other
df['State'].fillna('Other', inplace=True)

In [49]:
# get the most 52 common values from the state column (51 states + NA)
states = dict(df['State'].value_counts().head(52))

In [50]:
# remove any rows outside the most 52 common values
df = df[df['State'].isin(states.keys())]
df['State'].value_counts()

Other                   4152
California              2583
New York                2159
Massachusetts           1513
Texas                   1249
Illinois                1200
Washington              1176
District of Columbia     969
Pennsylvania             938
Virginia                 782
Minnesota                710
Ohio                     651
Colorado                 629
Oregon                   620
North Carolina           598
Maryland                 561
Michigan                 538
Georgia                  530
Florida                  517
Wisconsin                467
New Jersey               396
Missouri                 338
Indiana                  326
Arizona                  301
Tennessee                282
Connecticut              236
Utah                     207
Kentucky                 190
Iowa                     179
Kansas                   152
South Carolina           144
Louisiana                128
Maine                    125
New Hampshire            117
Alabama                  114
Oklahoma                 113
Nebraska                 109
New Mexico                98
Idaho                     96
Nevada                    91
Rhode Island              76
Arkansas                  70
Vermont                   66
Montana                   63
Alaska                    63
Mississippi               50
Delaware                  46
West Virginia             42
North Dakota              35
Hawaii                    30
South Dakota              24
Wyoming                   23
Name: State, dtype: int64

## City column

In [51]:
# rename the column to City

In [52]:
df['City'] = df['What city do you work in?']
df.drop('What city do you work in?', axis=1, inplace=True)

In [53]:
df['City'].value_counts()

Boston           769
Chicago          744
New York         706
Seattle          688
London           569
                ...
G                  1
Altadena           1
Hamilton           1
Lomdon             1
Maitland, NSW      1
Name: City, Length: 4408, dtype: int64

## it seems that New York city has the same problem we got with the country column, so we will fix it the same way

In [54]:
# let's convert the column first to String
df['City'] = df['City'].astype(str)
#first we will strip the rows in case it has some space
df['City'] = df['City'].apply(lambda x: x.strip())

In [55]:
def new_york_fixer(x):
    if x.lower() in ['new york', 'new york city', 'nyc', 'ny', 'new york, ny', 'new york, ny, usa']:
        return 'New York City'
    else:
        return x

In [56]:
#apply teh new_york_fixer function to the city column
df['City'] = df['City'].apply(new_york_fixer)

In [57]:
df['City'].value_counts()

New York City                    1585
Boston                            820
Chicago                           817
Seattle                           731
London                            613
                                 ...
aston                               1
Lynnfield (Boston metro area)       1
Southern Maine                      1
Barrie Ontario                      1
Maitland, NSW                       1
Name: City, Length: 3844, dtype: int64

In [58]:
df

,Job title,How many years of professional work experience do you have overall?,How many years of professional work experience do you have in your field?,What is your highest level of education completed?,What is your gender?,What is your race? (Choose all that apply.),Age,Industry,Salary,Bonus,total_salary,Country,State,City
0,research and instruction librarian,5-7 years,5-7 years,Master's degree,Woman,White,25-34,education (higher education),55000.0,0.0,55000.000000,United States,Massachusetts,Boston
1,change & internal communications manager,8 - 10 years,5-7 years,College degree,Non-binary,White,25-34,computing or tech,54600.0,4000.0,72814.841637,United Kingdom,Other,Cambridge
2,marketing specialist,2 - 4 years,2 - 4 years,College degree,Woman,White,25-34,"accounting, banking & finance",34000.0,0.0,34000.000000,United States,Tennessee,Chattanooga
3,program manager,8 - 10 years,5-7 years,College degree,Woman,White,25-34,nonprofits,62000.0,3000.0,65000.000000,United States,Wisconsin,Milwaukee
4,accounting manager,8 - 10 years,5-7 years,College degree,Woman,White,25-34,"accounting, banking & finance",60000.0,7000.0,67000.000000,United States,South Carolina,Greenville
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
27955,waitress,5-7 years,2 - 4 years,Some college,Woman,White,18-24,hospitality & events,35000.0,10000.0,45000.000000,United States,New York,Rochester
27956,porting agent,21 - 30 years,2 - 4 years,Some college,Man,"Hispanic, Latino, or Spanish origin",35-44,computing or tech,60000.0,5000.0,65000.000000,United States,Georgia,Atlanta
27957,post-doctoral associate,2 - 4 years,2 - 4 years,PhD,Man,White,25-34,research / gov,83000.0,0.0,83000.000000,United States,District of Columbia,Dc
27958,crm manager,5-7 years,2 - 4 years,Some college,Woman,White,25-34,"accounting, banking & finance",57000.0,0.0,70826.723094,United Kingdom,Other,London
27960,junior data analyst,21 - 30 years,1 year or less,College degree,Man,White,45-54,computing or tech,65000.0,0.0,65000.000000,United States,Virginia,Richmond

In [59]:
df.columns

Index(['Job title',
       'How many years of professional work experience do you have overall?',
       'How many years of professional work experience do you have in your field?',
       'What is your highest level of education completed?',
       'What is your gender?', 'What is your race? (Choose all that apply.)',
       'Age', 'Industry', 'Salary', 'Bonus', 'total_salary', 'Country',
       'State', 'City'],
      dtype='object')

## Overall experience column

In [60]:
df['Overall_experience'] = df['How many years of professional work experience do you have overall?']
df.drop('How many years of professional work experience do you have overall?', axis=1, inplace=True)

In [61]:
df['Overall_experience'].isna().sum()

0

In [62]:
# like the age columns it looks good and doesn't need any cleaning
df['Overall_experience'].value_counts()

11 - 20 years       9267
8 - 10 years        5169
5-7 years           4657
21 - 30 years       3505
2 - 4 years         2837
31 - 40 years        841
1 year or less       477
41 years or more     119
Name: Overall_experience, dtype: int64

## Field experience column

In [63]:
df['Field_experience'] = df['How many years of professional work experience do you have in your field?']
df.drop('How many years of professional work experience do you have in your field?', axis=1, inplace=True)

In [64]:
df['Field_experience'].isna().sum()

0

In [65]:
#agian it looks good and doesn't need any cleaning
df['Field_experience'].value_counts()

11 - 20 years       6310
5-7 years           6261
2 - 4 years         5919
8 - 10 years        4790
21 - 30 years       1797
1 year or less      1386
31 - 40 years        371
41 years or more      38
Name: Field_experience, dtype: int64

## Degree column

In [66]:
df['Degree'] = df['What is your highest level of education completed?']
df.drop('What is your highest level of education completed?', axis=1, inplace=True)

In [67]:
df['Degree'].isna().sum()
# drop null values since they are only 195
df.dropna(subset=['Degree'], inplace=True)

In [68]:
# nothing bad here
df['Degree'].value_counts()

College degree                        13060
Master's degree                        8438
Some college                           1967
PhD                                    1349
Professional degree (MD, JD, etc.)     1278
High School                             585
Name: Degree, dtype: int64

# Gender column

In [69]:
df['Gender'] = df['What is your gender?']
df.drop('What is your gender?', axis=1, inplace=True)

In [70]:
df['Gender'].isna().sum()
# drop null values
df.dropna(subset=['Gender'], inplace=True)

In [71]:
df['Gender'].value_counts()

Woman                            20506
Man                               5054
Non-binary                         719
Other or prefer not to answer      272
Prefer not to answer                 1
Name: Gender, dtype: int64

In [72]:
#get the 2 most common values in the gender column now using slicing
Genders = dict(df['Gender'].value_counts()[0:2])
df = df[df['Gender'].isin(Genders.keys())]

In [73]:
#check the gender column
df['Gender'].value_counts()

Woman    20506
Man       5054
Name: Gender, dtype: int64

## Race column

In [74]:
df['Race'] = df['What is your race? (Choose all that apply.)']
df.drop('What is your race? (Choose all that apply.)', axis=1, inplace=True)

In [75]:
df['Race'].isna().sum()
# drop null values
df.dropna(subset=['Race'], inplace=True)

In [76]:
df['Race'].value_counts()

White                                                                                                                            21457
Asian or Asian American                                                                                                           1236
Black or African American                                                                                                          619
Hispanic, Latino, or Spanish origin                                                                                                527
Another option not listed here or prefer not to answer                                                                             429
Hispanic, Latino, or Spanish origin, White                                                                                         348
Asian or Asian American, White                                                                                                     317
Black or African American, White                                                                                                   111
Middle Eastern or Northern African, White                                                                                           71
Native American or Alaska Native, White                                                                                             60
Middle Eastern or Northern African                                                                                                  57
White, Another option not listed here or prefer not to answer                                                                       51
Native American or Alaska Native                                                                                                    35
Black or African American, Hispanic, Latino, or Spanish origin                                                                      25
Asian or Asian American, Hispanic, Latino, or Spanish origin                                                                        13
Black or African American, Hispanic, Latino, or Spanish origin, White                                                               11
Asian or Asian American, Hispanic, Latino, or Spanish origin, White                                                                  9
Hispanic, Latino, or Spanish origin, Native American or Alaska Native, White                                                         9
Asian or Asian American, Another option not listed here or prefer not to answer                                                      9
Hispanic, Latino, or Spanish origin, Native American or Alaska Native                                                                9
Asian or Asian American, Black or African American                                                                                   7
Asian or Asian American, White, Another option not listed here or prefer not to answer                                               6
Asian or Asian American, Middle Eastern or Northern African                                                                          6
Asian or Asian American, Black or African American, White                                                                            6
Hispanic, Latino, or Spanish origin, Another option not listed here or prefer not to answer                                          6
Black or African American, Native American or Alaska Native, White                                                                   5
Asian or Asian American, Native American or Alaska Native, White                                                                     4
Black or African American, Middle Eastern or Northern African, White                                                                 4
Hispanic, Latino, or Spanish origin, Middle Eastern or Northern African, White                                                       3
Black or African American, Middle Eastern or Northern African                                                                        2
Black or African American, Hispanic, Latino, or Spanish origin, Native American or Alaska Native, White                              2
Black or African American, Another option not listed here or prefer not to answer                                                    2
Hispanic, Latino, or Spanish origin, Middle Eastern or Northern African                                                              2
Middle Eastern or Northern African, White, Another option not listed here or prefer not to answer                                    2
Middle Eastern or Northern African, Native American or Alaska Native                                                                 1
Asian or Asian American, Hispanic, Latino, or Spanish origin, Another option not listed here or prefer not to answer                 1
Asian or Asian American, Native American or Alaska Native                                                                            1
Hispanic, Latino, or Spanish origin, Native American or Alaska Native, Another option not listed here or prefer not to answer        1
Native American or Alaska Native, White, Another option not listed here or prefer not to answer                                      1
Asian or Asian American, Middle Eastern or Northern African, White                                                                   1
Middle Eastern or Northern African, Native American or Alaska Native, White                                                          1
Asian or Asian American, Hispanic, Latino, or Spanish origin, Native American or Alaska Native, White                                1
Native American or Alaska Native, Another option not listed here or prefer not to answer                                             1
Black or African American, Middle Eastern or Northern African, Native American or Alaska Native, White                               1
Asian or Asian American, Hispanic, Latino, or Spanish origin, White, Another option not listed here or prefer not to answer          1
Name: Race, dtype: int64

In [77]:
df

,Job title,Age,Industry,Salary,Bonus,total_salary,Country,State,City,Overall_experience,Field_experience,Degree,Gender,Race
0,research and instruction librarian,25-34,education (higher education),55000.0,0.0,55000.000000,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White
2,marketing specialist,25-34,"accounting, banking & finance",34000.0,0.0,34000.000000,United States,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,White
3,program manager,25-34,nonprofits,62000.0,3000.0,65000.000000,United States,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,White
4,accounting manager,25-34,"accounting, banking & finance",60000.0,7000.0,67000.000000,United States,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,White
5,scholarly publishing librarian,25-34,education (higher education),62000.0,0.0,62000.000000,United States,New Hampshire,Hanover,8 - 10 years,2 - 4 years,Master's degree,Man,White
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
27955,waitress,18-24,hospitality & events,35000.0,10000.0,45000.000000,United States,New York,Rochester,5-7 years,2 - 4 years,Some college,Woman,White
27956,porting agent,35-44,computing or tech,60000.0,5000.0,65000.000000,United States,Georgia,Atlanta,21 - 30 years,2 - 4 years,Some college,Man,"Hispanic, Latino, or Spanish origin"
27957,post-doctoral associate,25-34,research / gov,83000.0,0.0,83000.000000,United States,District of Columbia,Dc,2 - 4 years,2 - 4 years,PhD,Man,White
27958,crm manager,25-34,"accounting, banking & finance",57000.0,0.0,70826.723094,United Kingdom,Other,London,5-7 years,2 - 4 years,Some college,Woman,White
27960,junior data analyst,45-54,computing or tech,65000.0,0.0,65000.000000,United States,Virginia,Richmond,21 - 30 years,1 year or less,College degree,Man,White

In [78]:
df.isna().sum()

Job title             0
Age                   0
Industry              0
Salary                0
Bonus                 0
total_salary          0
Country               0
State                 0
City                  0
Overall_experience    0
Field_experience      0
Degree                0
Gender                0
Race                  0
dtype: int64

In [79]:
df.to_csv('Survey_data_cleaned.csv', index=False)